{
  "projects": [
    {
      "id": "imitation-learning-controller",
      "number": "01",
      "title": "Imitation Learning Tool",
      "subtitle": "Design, fabricate and program a PCB to control and power an imitation learning data collecting tool",
      "description": "Multi-interface platform with custom PCB design. Low-power RP2040 implementation featuring ROS Serial and custom interactive UI.",
      "thumbnail": "images/Nupeak/Imitation Learning Controller.png",
      "tags": [
        "RP2040",
        "KiCad",
        "ROS Serial",
        "Squareline Studio"
      ],
      "meta": {
        "role": "Embedded Systems Intern",
        "timeline": "3 months",
        "teamSize": "Solo"
      },
      "techTags": [
        "KiCad",
        "RP2040",
        "ROS Noetic",
        "C#",
        "Squareline Studio"
      ],
      "sections": [
        {
          "type": "overview",
          "heading": "Overview",
          "content": "During a summer internship at Nupeak Robotics after my freshman year, I designed and built a fully integrated robot training tool from the ground up — despite having no prior embedded systems experience. Over three months, I developed hands-on expertise in PCB design, UI integration, and firmware programming, ultimately delivering a ROS-enabled platform now used by the company to collect imitation learning data for training robot arms."
        },
        {
          "type": "gallery",
          "layout": "side-by-side",
          "images": [
            {
              "src": "images/Nupeak/NupeakV1.png",
              "alt": "V1 Main Controller PCB",
              "caption": "V1 — designed from scratch in KiCad. Migrated to the RP2350B, added a BLDC motor controller, TFT display, and tactile buttons, with stepped-down power rails (12V → 3.3V / 5V)."
            }
          ]
        },
        {
          "type": "problem",
          "heading": "Problem & Constraints",
          "content": "Following design reviews with the CTO and senior engineers, several critical areas for improvement were identified in V1. Signal integrity issues in the routing risked unreliable communication between the microcontroller and peripherals. EMI noise posed a threat to sensor accuracy and overall system stability. Physical space constraints made efficient component placement and trace routing a significant challenge, while power line losses threatened to reduce the efficiency of the stepped-down rails. Balancing all four concerns simultaneously — without compromising the board's compact form factor or timeline — became the central challenge of the next iteration."
        },
        {
          "type": "overview",
          "heading": "V2 — Layout Refinement",
          "content": "V2 was a focused response to the issues surfaced in design review. The overall board size was reduced through more strategic placement of connectors and decoupling capacitors, and the mounting points were trimmed from four to three to avoid over-constraining the mechanical assembly. Signal integrity saw significant improvement: minimal traces run beneath or parallel to the USB differential pair, the motor driver power and signal return paths are separated from noise-sensitive elements, higher-power rails were widened to reduce energy loss, and perpendicular layer crossings were adopted to minimize EMI and crosstalk. The stackup follows the conventional 4-layer SGPS arrangement."
        },
        {
          "type": "gallery",
          "layout": "side-by-side",
          "images": [
            {
              "src": "images/Nupeak/NupeakV2.png",
              "alt": "PCB V2.0",
              "caption": "V2.0 — refined layout addressing the signal integrity and space constraints from design review."
            }
          ]
        },
        {
          "type": "overview",
          "heading": "V3 — Key Technical Decisions",
          "content": "The most significant change in V3 was switching from a linear regulator to a buck converter to accommodate the increased power budget from the BLDC motor. This required more intentional component placement with return paths in mind — inductors and the converter were placed along the board edge to minimize noise. Solder jumpers were introduced as a flexible way to reassign GPIO functionality without board respins, since the peripheral count was pushing the pin budget. A haptics element (LRA + driver) was also added for a more customizable user experience. The layer stackup was refined: signal traces are confined to the top and bottom layers, with complete ground and power pours in the middle. The top pour is reserved for the high-power 12V rail only, top-layer traces run perpendicular to the bottom layer, and no signal line runs below the differential USB pair."
        },
        {
          "type": "gallery",
          "layout": "side-by-side",
          "images": [
            {
              "src": "images/Nupeak/NupeakV3.png",
              "alt": "PCB V3.0",
              "caption": "V3.0 — final revision with buck converter, solder jumpers, haptics, and refined 4-layer stackup."
            }
          ]
        },
        {
          "type": "gallery",
          "layout": "grid-3",
          "images": [
            {
              "src": "images/Nupeak/Screen.png",
              "alt": "Power management schematic",
              "caption": "Power supply circuit with voltage regulation"
            },
            {
              "src": "images/Nupeak/NupeakDPad.png",
              "alt": "Microcontroller schematic",
              "caption": "Microcontroller circuit with peripheral connections"
            },
            {
              "src": "images/Nupeak/NupeakTrig.png",
              "alt": "Sensor interface schematic",
              "caption": "Sensor interface circuits and signal conditioning"
            }
          ]
        },
        {
          "type": "full-width-image",
          "src": "images/Nupeak/IMG_1456.jpeg",
          "alt": "Assembled PCB",
          "caption": "Fully assembled and tested PCB ready for integration"
        },
        {
          "type": "overview",
          "heading": "Firmware & UI",
          "content": "Alongside the hardware iterations, the firmware and user interface were developed in parallel. The RP2350B's dual cores were partitioned by responsibility: Core 0 handles the ROS Serial communication layer, running custom service-client nodes that expose the device's actuators and sensors to the broader ROS Noetic pipeline, while Core 1 is dedicated to the UI — driving the SquareLine Studio-designed TFT interface (built on the LVGL graphics library) for real-time monitoring and interactive control. This split keeps latency-sensitive I/O and serial communication isolated from the rendering loop, ensuring neither task blocks the other."        },
        {
          "type": "gallery",
          "layout": "grid-2",
          "images": [
            {
              "src": "images/Nupeak/SquarelineUIV1.png",
              "alt": "Firmware architecture",
              "caption": "V1.0 UI Design with limited features"
            },
            {
              "src": "images/Nupeak/SquarelineUIV2.png",
              "alt": "User interface display",
              "caption": "V2.0 Interactive UI over ROS, including battery level, tracking status, recording count, etc"
            }
          ]
        },
        {
          "type": "results",
          "heading": "Results & Impact",
          "content": "",
          "metrics": [
            {
              "value": "20s",
              "label": "Time saved per recording"
            },
            {
              "value": "100%",
              "label": "PCBs' Functional Rate"
            },
            {
              "value": "7",
              "label": "Additional Features"
            }
          ]
        },
        {
          "type": "gallery",
          "layout": "grid-2",
          "images": [
            {
              "src": "images/Nupeak/Arduino.png",
              "alt": "Testing setup",
              "caption": "Testing environment with measurement equipment"
            },
            {
              "src": "images/Nupeak/Imitation Learning Controller.png",
              "alt": "Final integration",
              "caption": "Complete system integrated into the imitation learning platform"
            }
          ]
        },
        {
          "type": "overview",
          "heading": "Additional Images",
          "content": ""
        },
        {
          "type": "gallery",
          "layout": "grid-3",
          "images": [
            {
              "src": "images/Nupeak/NupeakInject.png",
              "alt": "Development process",
              "caption": "CAN + PWR Injector Board"
            },
            {
              "src": "images/Nupeak/fab.jpeg",
              "alt": "Component selection",
              "caption": "Fabricating PCBs using Stencile"
            },
            {
              "src": "images/Nupeak/fab2.jpeg",
              "alt": "Debugging session",
              "caption": "Finished Assembled LED PCBs"
            },
            {
              "src": "images/Nupeak/test.jpeg",
              "alt": "PCB manufacturing",
              "caption": "Testing LED RGB Command"
            },
            {
              "type": "video",
              "src": "images/Nupeak/mov1.MOV",
              "format": "mp4",
              "alt": "Field testing",
              "caption": "Testing LVGL Graphics Export"
            },
            {
              "type": "video",
              "src": "images/Nupeak/mov2.MOV",
              "format": "mp4",
              "alt": "Final deployment",
              "caption": "Testing ROS Serial"
            }
          ]
        }
      ]
    },
    {
      "id": "system-on-module",
      "number": "02",
      "title": "System-on-Module",
      "subtitle": "System-on-Module for local motor control for quadruped project",
      "description": "Compact motor control module using RP2350B for distributed actuation in quadruped robotics. Custom castellated edge design for board-to-board stacking with optimized signal integrity.",
      "thumbnail": "images/Atombot/v3.png",
      "tags": [
        "RP2350B",
        "KiCad"
      ],
      "meta": {
        "role": "Hardware Engineer",
        "timeline": "2 months",
        "teamSize": "3"
      },
      "techTags": [
        "RP2350B",
        "KiCad"
      ],
      "sections": [
        {
          "type": "overview",
          "heading": "Overview",
          "content": "Built a compact System-on-Module to control individual joint actuators in a quadruped robot. Each leg needed its own local controller to handle motor commands without overwhelming the main processor, so I designed this board around the RP2350B to sit right next to each actuator. Getting clean signals in an environment full of motor noise took several iterations, but the final design handles the electrical chaos of PWM motor drivers while keeping communication rock-solid."
        },
        {
          "type": "gallery",
          "layout": "side-by-side",
          "images": [
            {
              "src": "images/Atombot/v1.png",
              "alt": "System-on-Module V1",
              "caption": "V1 — Initial SoM design with RP2350B, external crystal, and flash memory for program storage."
            }
          ]
        },
        {
          "type": "problem",
          "heading": "Problem & Constraints",
          "content": "Twelve motors switching at high frequencies creates an electrical nightmare. The SoM had to fit in tight spaces near each joint while dealing with all that noise, plus handle high-speed communication between modules without dropping data. The mechanical team needed castellated edges for board-to-board stacking to save space. The approach was to keep the module dead simple — just the brain (RP2350B), its clock, and flash memory. All the power and motor control stuff stays on the main board. So the real challenge was keeping differential signals clean, making sure the crystal circuit was stable, and designing custom castellated edges that could handle repeated assembly cycles."
        },
        {
          "type": "overview",
          "heading": "Technical Approach",
          "content": "Signal integrity was the main battle here. I routed all high-speed differential pairs with matched lengths and controlled impedance — if the timing's off even slightly, you get data corruption. Scattered vias everywhere for ground plane stitching to give return currents a clean path back and cut down on EMI. Kept power and ground planes separate so digital noise wouldn't couple into anything sensitive. The castellated edges were initially through hole pin headers, but in V2 I decided to design a custom one since I couldn't find a footprint that worked for our stacking scheme. The design is intentionally minimal — just the RP2350B, a crystal for stable clocking, and external flash for program storage. Everything else (power regulation, motor drivers) lives on the main board that this module plugs into."
        },
        {
          "type": "gallery",
          "layout": "grid-2",
          "images": [
            {
              "src": "images/Atombot/v1.1.png",
              "alt": "SoM V2",
              "caption": "V2 — Added castellated edges for board-to-board stacking"
            },
            {
              "src": "images/Atombot/v2.png",
              "alt": "SoM V3",
              "caption": "V3 — Design with optimized signal integrity and custom castellated footprint"
            }
          ]
        },
        {
          "type": "results",
          "heading": "Results & Impact",
          "content": "",
          "metrics": [
            {
              "value": "4",
              "label": "Design Iterations"
            },
            {
              "value": "4",
              "label": "Modules Per Robot"
            },
            {
              "value": "100%",
              "label": "First Assembly Success"
            }
          ]
        },
        {
          "type": "gallery",
          "layout": "side-by-side",
          "images": [
            {
              "src": "images/Atombot/v3.png",
              "alt": "Assembled module",
              "caption": "Final SoM board with improved component orientation and castellated edges"
            }
          ]
        }
      ]
    },
    {
      "id": "wearable-health-tracker",
      "number": "03",
      "title": "Wearable Health Tracker",
      "subtitle": "Ultra-low-power biometric monitoring device",
      "description": "Ultra-low-power wearable with flex PCB. Heart rate monitoring, activity tracking, and BLE connectivity achieving 14+ days battery life in a compact form factor.",
      "thumbnail": "",
      "tags": [
        "nRF52",
        "BLE",
        "Flex PCB"
      ],
      "meta": {
        "role": "Embedded Engineer",
        "timeline": "5 months",
        "teamSize": "3"
      },
      "techTags": [
        "nRF52832",
        "Bluetooth 5.0",
        "Flex PCB",
        "Power Management"
      ],
      "sections": [
        {
          "type": "overview",
          "heading": "Overview",
          "content": "Designed and developed an ultra-low-power wearable health tracker featuring continuous heart rate monitoring, activity tracking, and Bluetooth Low Energy connectivity. The device utilizes a flexible PCB to conform to wrist contours, integrating the nRF52832 SoC with optimized power management to achieve over 14 days of battery life. The project encompassed hardware design, firmware development, and mobile app integration for real-time biometric data visualization."
        },
        {
          "type": "gallery",
          "layout": "side-by-side",
          "images": [
            {
              "src": "images/Wearable/flex-pcb-v1.png",
              "alt": "Flex PCB Design",
              "caption": "V1 — Flexible PCB layout optimized for wrist-worn form factor with nRF52832, PPG sensor, and accelerometer."
            }
          ]
        },
        {
          "type": "problem",
          "heading": "Problem & Constraints",
          "content": "Wearable devices face unique engineering challenges: extreme power constraints requiring operation on a small battery for weeks, mechanical flexibility to fit curved surfaces while maintaining electrical reliability, and accurate biometric sensing despite motion artifacts and varying skin contact. The design needed to balance sensor performance with power consumption, maintain BLE connectivity range, fit within a compact wearable form factor, and ensure robust operation through daily wear including water exposure and physical impacts."
        },
        {
          "type": "overview",
          "heading": "Hardware Design",
          "content": "The flex PCB design uses a multi-layer stackup with rigid sections for components and flexible interconnects for articulation. The nRF52832 was selected for its integrated BLE radio and ultra-low-power modes. Power management employs a buck converter for efficient battery regulation, with aggressive sleep modes reducing average current to under 50µA. The PPG sensor module features optimized LED drive circuitry and transimpedance amplifier for heart rate detection. An accelerometer enables motion tracking and gesture recognition while serving as a wake source. Strategic component placement minimizes flex zone stress and maintains signal integrity."
        },
        {
          "type": "gallery",
          "layout": "grid-3",
          "images": [
            {
              "src": "images/Wearable/power-tree.png",
              "alt": "Power architecture",
              "caption": "Ultra-low-power architecture with multiple sleep modes"
            },
            {
              "src": "images/Wearable/sensor-circuit.png",
              "alt": "Biometric sensors",
              "caption": "PPG heart rate sensor and accelerometer interface circuits"
            },
            {
              "src": "images/Wearable/flex-layers.png",
              "alt": "Flex PCB stackup",
              "caption": "Multi-layer flexible PCB design with rigid-flex transitions"
            }
          ]
        },
        {
          "type": "full-width-image",
          "src": "images/Wearable/assembled-device.jpeg",
          "alt": "Assembled wearable",
          "caption": "Fully assembled wearable device with flex PCB in final enclosure"
        },
        {
          "type": "overview",
          "heading": "Firmware & Algorithms",
          "content": "The firmware architecture implements a state machine managing sensor sampling, data processing, and BLE communication. Heart rate detection uses a PPG signal processing pipeline with adaptive filtering, peak detection, and artifact rejection algorithms. A complementary filter fuses accelerometer data for step counting and activity classification. The BLE stack operates in peripheral mode, advertising health data using standard GATT profiles. Deep sleep modes are leveraged between sensor readings, with the RTC waking the system at configured intervals. Flash memory stores historical data for later synchronization when disconnected from the mobile app."
        },
        {
          "type": "gallery",
          "layout": "grid-2",
          "images": [
            {
              "src": "images/Wearable/signal-processing.png",
              "alt": "PPG processing",
              "caption": "Heart rate signal processing and peak detection algorithm"
            },
            {
              "src": "images/Wearable/app-interface.png",
              "alt": "Mobile app",
              "caption": "Mobile app interface displaying real-time biometric data"
            }
          ]
        },
        {
          "type": "results",
          "heading": "Results & Impact",
          "content": "",
          "metrics": [
            {
              "value": "14+ days",
              "label": "Battery life"
            },
            {
              "value": "±2 BPM",
              "label": "Heart rate accuracy"
            },
            {
              "value": "<50µA",
              "label": "Average current draw"
            }
          ]
        },
        {
          "type": "gallery",
          "layout": "grid-2",
          "images": [
            {
              "src": "images/Wearable/validation-setup.png",
              "alt": "Validation testing",
              "caption": "Heart rate accuracy validation against reference equipment"
            },
            {
              "src": "images/Wearable/user-testing.png",
              "alt": "User testing",
              "caption": "Field testing with users in various activity scenarios"
            }
          ]
        },
        {
          "type": "overview",
          "heading": "Additional Images",
          "content": ""
        },
        {
          "type": "gallery",
          "layout": "grid-3",
          "images": [
            {
              "src": "images/Wearable/prototype-assembly.jpeg",
              "alt": "Prototype assembly",
              "caption": "Early prototype with test points and debug interfaces"
            },
            {
              "src": "images/Wearable/flex-bending.jpeg",
              "alt": "Flex testing",
              "caption": "Mechanical flex testing and bend radius validation"
            },
            {
              "src": "images/Wearable/power-measurement.jpeg",
              "alt": "Power profiling",
              "caption": "Current consumption measurement across different modes"
            },
            {
              "src": "images/Wearable/enclosure-fit.jpeg",
              "alt": "Enclosure integration",
              "caption": "PCB integration into wearable enclosure design"
            },
            {
              "type": "video",
              "src": "images/Wearable/heart-rate-demo.mp4",
              "format": "mp4",
              "alt": "Heart rate monitoring",
              "caption": "Real-time heart rate detection and BLE streaming"
            },
            {
              "type": "video",
              "src": "images/Wearable/activity-tracking.mp4",
              "format": "mp4",
              "alt": "Activity tracking",
              "caption": "Step counting and activity recognition demonstration"
            }
          ]
        }
      ]
    }
  ]
}