{
  "projects": [
    {
      "id": "imitation-learning-controller",
      "number": "01",
      "title": "Imitation Learning Tool",
      "subtitle": "Design, fabricate and program a PCB to control and power an imitation learning data collecting tool",
      "description": "Multi-interface platform with custom PCB design. Low-power RP2040 implementation featuring ROS Serial and custom interactive UI.",
      "thumbnail": "images/Nupeak/Imitation Learning Controller.png",
      "tags": [
        "RP2040",
        "KiCad",
        "ROS Serial",
        "Squareline Studio"
      ],
      "meta": {
        "role": "Embedded Systems Intern",
        "timeline": "3 months",
        "teamSize": "Solo"
      },
      "techTags": [
        "KiCad",
        "RP2040",
        "ROS Noetic",
        "C#",
        "Squareline Studio"
      ],
      "sections": [
        {
          "type": "overview",
          "heading": "Overview",
          "content": "During a summer internship at Nupeak Robotics after my freshman year, I designed and built a fully integrated robot training tool from the ground up — despite having no prior embedded systems experience. Over three months, I developed hands-on expertise in PCB design, UI integration, and firmware programming, ultimately delivering a ROS-enabled platform now used by the company to collect imitation learning data for training robot arms."
        },
        {
          "type": "gallery",
          "layout": "side-by-side",
          "images": [
            {
              "src": "images/Nupeak/NupeakV1.png",
              "alt": "V1 Main Controller PCB",
              "caption": "V1 — designed from scratch in KiCad. Migrated to the RP2350B, added a BLDC motor controller, TFT display, and tactile buttons, with stepped-down power rails (12V → 3.3V / 5V)."
            }
          ]
        },
        {
          "type": "problem",
          "heading": "Problem & Constraints",
          "content": "Following design reviews with the CTO and senior engineers, several critical areas for improvement were identified in V1. Signal integrity issues in the routing risked unreliable communication between the microcontroller and peripherals. EMI noise posed a threat to sensor accuracy and overall system stability. Physical space constraints made efficient component placement and trace routing a significant challenge, while power line losses threatened to reduce the efficiency of the stepped-down rails. Balancing all four concerns simultaneously — without compromising the board's compact form factor or timeline — became the central challenge of the next iteration."
        },
        {
          "type": "overview",
          "heading": "V2 — Layout Refinement",
          "content": "V2 was a focused response to the issues surfaced in design review. The overall board size was reduced through more strategic placement of connectors and decoupling capacitors, and the mounting points were trimmed from four to three to avoid over-constraining the mechanical assembly. Signal integrity saw significant improvement: minimal traces run beneath or parallel to the USB differential pair, the motor driver power and signal return paths are separated from noise-sensitive elements, higher-power rails were widened to reduce energy loss, and perpendicular layer crossings were adopted to minimize EMI and crosstalk. The stackup follows the conventional 4-layer SGPS arrangement."
        },
        {
          "type": "gallery",
          "layout": "side-by-side",
          "images": [
            {
              "src": "images/Nupeak/NupeakV2.png",
              "alt": "PCB V2.0",
              "caption": "V2.0 — refined layout addressing the signal integrity and space constraints from design review."
            }
          ]
        },
        {
          "type": "overview",
          "heading": "V3 — Key Technical Decisions",
          "content": "The most significant change in V3 was switching from a linear regulator to a buck converter to accommodate the increased power budget from the BLDC motor. This required more intentional component placement with return paths in mind — inductors and the converter were placed along the board edge to minimize noise. Solder jumpers were introduced as a flexible way to reassign GPIO functionality without board respins, since the peripheral count was pushing the pin budget. A haptics element (LRA + driver) was also added for a more customizable user experience. The layer stackup was refined: signal traces are confined to the top and bottom layers, with complete ground and power pours in the middle. The top pour is reserved for the high-power 12V rail only, top-layer traces run perpendicular to the bottom layer, and no signal line runs below the differential USB pair."
        },
        {
          "type": "gallery",
          "layout": "side-by-side",
          "images": [
            {
              "src": "images/Nupeak/NupeakV3.png",
              "alt": "PCB V3.0",
              "caption": "V3.0 — final revision with buck converter, solder jumpers, haptics, and refined 4-layer stackup."
            }
          ]
        },
        {
          "type": "gallery",
          "layout": "grid-3",
          "images": [
            {
              "src": "images/Nupeak/Screen.png",
              "alt": "Power management schematic",
              "caption": "Power supply circuit with voltage regulation"
            },
            {
              "src": "images/Nupeak/NupeakDPad.png",
              "alt": "Microcontroller schematic",
              "caption": "Microcontroller circuit with peripheral connections"
            },
            {
              "src": "images/Nupeak/NupeakTrig.png",
              "alt": "Sensor interface schematic",
              "caption": "Sensor interface circuits and signal conditioning"
            }
          ]
        },
        {
          "type": "full-width-image",
          "src": "images/Nupeak/IMG_1456.jpeg",
          "alt": "Assembled PCB",
          "caption": "Fully assembled and tested PCB ready for integration"
        },
        {
          "type": "overview",
          "heading": "Firmware & UI",
          "content": "Alongside the hardware iterations, the firmware and user interface were developed in parallel. The RP2350B's dual cores were partitioned by responsibility: Core 0 handles the ROS Serial communication layer, running custom service-client nodes that expose the device's actuators and sensors to the broader ROS Noetic pipeline, while Core 1 is dedicated to the UI — driving the SquareLine Studio-designed TFT interface (built on the LVGL graphics library) for real-time monitoring and interactive control. This split keeps latency-sensitive I/O and serial communication isolated from the rendering loop, ensuring neither task blocks the other."        },
        {
          "type": "gallery",
          "layout": "grid-2",
          "images": [
            {
              "src": "images/Nupeak/SquarelineUIV1.png",
              "alt": "Firmware architecture",
              "caption": "V1.0 UI Design with limited features"
            },
            {
              "src": "images/Nupeak/SquarelineUIV2.png",
              "alt": "User interface display",
              "caption": "V2.0 Interactive UI over ROS, including battery level, tracking status, recording count, etc"
            }
          ]
        },
        {
          "type": "results",
          "heading": "Results & Impact",
          "content": "",
          "metrics": [
            {
              "value": "20s",
              "label": "Time saved per recording"
            },
            {
              "value": "100%",
              "label": "PCBs' Functional Rate"
            },
            {
              "value": "7",
              "label": "Additional Features"
            }
          ]
        },
        {
          "type": "gallery",
          "layout": "grid-2",
          "images": [
            {
              "src": "images/Nupeak/Arduino.png",
              "alt": "Testing setup",
              "caption": "Testing environment with measurement equipment"
            },
            {
              "src": "images/Nupeak/Imitation Learning Controller.png",
              "alt": "Final integration",
              "caption": "Complete system integrated into the imitation learning platform"
            }
          ]
        },
        {
          "type": "overview",
          "heading": "Additional Images",
          "content": ""
        },
        {
          "type": "gallery",
          "layout": "grid-3",
          "images": [
            {
              "src": "images/Nupeak/NupeakInject.png",
              "alt": "Development process",
              "caption": "CAN + PWR Injector Board"
            },
            {
              "src": "images/Nupeak/fab.jpeg",
              "alt": "Component selection",
              "caption": "Fabricating PCBs using Stencile"
            },
            {
              "src": "images/Nupeak/fab2.jpeg",
              "alt": "Debugging session",
              "caption": "Finished Assembled LED PCBs"
            },
            {
              "src": "images/Nupeak/test.jpeg",
              "alt": "PCB manufacturing",
              "caption": "Testing LED RGB Command"
            },
            {
              "type": "video",
              "src": "images/Nupeak/mov1.MOV",
              "format": "mp4",
              "alt": "Field testing",
              "caption": "Testing LVGL Graphics Export"
            },
            {
              "type": "video",
              "src": "images/Nupeak/mov2.MOV",
              "format": "mp4",
              "alt": "Final deployment",
              "caption": "Testing ROS Serial"
            }
          ]
        }
      ]
    },
    {
      "id": "system-on-module",
      "number": "02",
      "title": "System-on-Module",
      "subtitle": "System-on-Module for local motor control for quadruped project",
      "description": "Compact motor control module using RP2350B for distributed actuation in quadruped robotics. Custom castellated edge design for board-to-board stacking with optimized signal integrity.",
      "thumbnail": "images/Atombot/v3.png",
      "tags": [
        "RP2350B",
        "KiCad"
      ],
      "meta": {
        "role": "Hardware Engineer",
        "timeline": "2 months",
        "teamSize": "3"
      },
      "techTags": [
        "RP2350B",
        "KiCad"
      ],
      "sections": [
        {
          "type": "overview",
          "heading": "Overview",
          "content": "Built a compact System-on-Module to control individual joint actuators in a quadruped robot. Each leg needed its own local controller to handle motor commands without overwhelming the main processor, so I designed this board around the RP2350B to sit right next to each actuator. Getting clean signals in an environment full of motor noise took several iterations, but the final design handles the electrical chaos of PWM motor drivers while keeping communication rock-solid."
        },
        {
          "type": "gallery",
          "layout": "side-by-side",
          "images": [
            {
              "src": "images/Atombot/v1.png",
              "alt": "System-on-Module V1",
              "caption": "V1 — Initial SoM design with RP2350B, external crystal, and flash memory for program storage."
            }
          ]
        },
        {
          "type": "problem",
          "heading": "Problem & Constraints",
          "content": "Twelve motors switching at high frequencies creates an electrical nightmare. The SoM had to fit in tight spaces near each joint while dealing with all that noise, plus handle high-speed communication between modules without dropping data. The mechanical team needed castellated edges for board-to-board stacking to save space. The approach was to keep the module dead simple — just the brain (RP2350B), its clock, and flash memory. All the power and motor control stuff stays on the main board. So the real challenge was keeping differential signals clean, making sure the crystal circuit was stable, and designing custom castellated edges that could handle repeated assembly cycles."
        },
        {
          "type": "overview",
          "heading": "Technical Approach",
          "content": "Signal integrity was the main battle here. I routed all high-speed differential pairs with matched lengths and controlled impedance — if the timing's off even slightly, you get data corruption. Scattered vias everywhere for ground plane stitching to give return currents a clean path back and cut down on EMI. Kept power and ground planes separate so digital noise wouldn't couple into anything sensitive. The castellated edges were initially through hole pin headers, but in V2 I decided to design a custom one since I couldn't find a footprint that worked for our stacking scheme. The design is intentionally minimal — just the RP2350B, a crystal for stable clocking, and external flash for program storage. Everything else (power regulation, motor drivers) lives on the main board that this module plugs into."
        },
        {
          "type": "gallery",
          "layout": "grid-2",
          "images": [
            {
              "src": "images/Atombot/v1.1.png",
              "alt": "SoM V2",
              "caption": "V2 — Added castellated edges for board-to-board stacking"
            },
            {
              "src": "images/Atombot/v2.png",
              "alt": "SoM V3",
              "caption": "V3 — Design with optimized signal integrity and custom castellated footprint"
            }
          ]
        },
        {
          "type": "results",
          "heading": "Results & Impact",
          "content": "",
          "metrics": [
            {
              "value": "4",
              "label": "Design Iterations"
            },
            {
              "value": "4",
              "label": "Modules Per Robot"
            },
            {
              "value": "100%",
              "label": "First Assembly Success"
            }
          ]
        },
        {
          "type": "gallery",
          "layout": "side-by-side",
          "images": [
            {
              "src": "images/Atombot/v3.png",
              "alt": "Assembled module",
              "caption": "Final SoM board with improved component orientation and castellated edges"
            }
          ]
        }
      ]
    },
    {
      "id": "d-stock-telemetry",
      "number": "03",
      "title": "D-Stock Racing Telemetry System",
      "subtitle": "Led cockpit board design and contributed to telemetry system for high-speed marine racing application",
      "description": "Led cockpit board design in Altium using STM32F4 for high-speed D-Stock boat racing. Rigid-flex PCB with multi-rail power management (48V-3.3V) and complete HV/LV isolation. Contributed to telemetry board with GPS and CAN bus.",
      "thumbnail": "images/UMEB/iso-cock.png",
      "tags": [
        "STM32F4",
        "Rigid-Flex PCB",
        "Altium",
        "Iso CAN"
      ],
      "meta": {
        "role": "Computing Hardware Lead",
        "timeline": "5 months",
        "teamSize": "3"
      },
      "techTags": [
        "Altium Designer",
        "STM32F4",
        "Iso CAN",
        "Antenna",
        "SD Card"
      ],
      "sections": [
        {
          "type": "overview",
          "heading": "Overview",
          "content": "Led the complete design of the cockpit board and contributed to the telemetry board for high-speed D-Stock boat racing applications. The cockpit system features a rigid-flex PCB with multi-rail power management (48V to 3.3V), while the telemetry board provides GPS tracking and CAN bus communication. Through three design iterations on the cockpit board, the system evolved from a basic two-board design to a highly integrated rigid-flex solution with complete high-voltage/low-voltage isolation and enhanced signal integrity."
        },
        {
          "type": "problem",
          "heading": "Problem & Constraints",
          "content": "High-speed boat racing demands extreme reliability in harsh conditions including constant vibration, water exposure, and electrical noise from high-power motors. The cockpit system needed to manage 48V high-voltage inputs while providing clean 3.3V logic signals, all within a compact form factor that could withstand mechanical shock. Signal integrity was critical for GPS antenna routing and CAN bus communication, while the design had to maintain complete electrical isolation between high-voltage and low-voltage circuits to ensure safety and prevent ground loops."
        },
        {
          "type": "technical",
          "heading": "Technical Approach & Design Evolution",
          "content": "The project evolved through three major iterations, each addressing specific challenges discovered through testing and real-world operation. Starting with a basic two-layer design, the system progressively improved in reliability, signal integrity, and manufacturing robustness.",
          "subsections": [
            {
              "heading": "V1: Foundation Design",
              "content": "The initial design established the core architecture with SD card logging using pull-up resistors for SPI communication, M12 connectors for high reliability and voltage rating in marine environments, comprehensive test points for debugging, CAN transceiver with basic signal integrity measures, fundamental HV/LV separation on the same board, DPDT relay for HV contactor control, backup SPDTs for digital switching redundancy, and Boot option paired with RST button for programming flexibility."
            }
          ]
        },
        {
          "type": "gallery",
          "layout": "grid-2",
          "images": [
            {
              "src": "images/UMEB/v1.png",
              "alt": "Version 1 PCB",
              "caption": "V1: Initial two-layer design with basic HV/LV separation, M12 connectors, and DPDT relay for HV contactor control"
            },
            {
              "src": "images/UMEB/v1a.jpg",
              "alt": "V2 Assembled Board",
              "caption": "V2 assembled and tested in lab environment"
            }
          ]
        },
        {
          "type": "technical",
          "heading": "V2: Signal Integrity & Separation",
          "content": "",
          "subsections": [
            {
              "heading": "Key Improvements",
              "content": "Version 2 introduced significant improvements including SD card buffer for enhanced signal integrity and drive strength, external resistor for crystal oscillator to limit current and improve stability, complete HV/LV separation using stacked boards for superior isolation and better size constraints, FFC (Flexible Flat Cable) connectors for inter-board communication, simplified programming interface with SWD and Boot0 elimination (RST button only), and buffered SD card signals for improved reliability at higher speeds."
            }
          ]
        },
        {
          "type": "gallery",
          "layout": "grid-2",
          "images": [
            {
              "src": "images/UMEB/v2.png",
              "alt": "Version 2 PCB",
              "caption": "V2: Stacked board architecture with FFC connector for complete HV/LV separation"
            },
            {
              "src": "images/UMEB/v2t.png",
              "alt": "V2 Assembled Board",
              "caption": "V2 assembled and tested in lab environment"
            }
          ]
        },
        {
          "type": "technical",
          "heading": "V3: Rigid-Flex Integration",
          "content": "",
          "subsections": [
            {
              "heading": "Final Design Achievements",
              "content": "The final iteration achieved professional-grade reliability through rigid-flex PCB construction eliminating two failure points from connectors while providing superior vibration resistance, complete galvanic isolation between HV and LV sections, 40% more compact footprint, enhanced CAN signal integrity through controlled impedance routing and proper termination, strategic ground plane cutouts under switching regulators to reduce EMI, backup SD card pin header for external reading during diagnostics, and BJT-based LED drivers to protect GPIO pins from overcurrent conditions."
            }
          ]
        },
        {
          "type": "gallery",
          "layout": "grid-3",
          "images": [
            {
              "src": "images/UMEB/iso-cock.png",
              "alt": "V3 3D Rendering",
              "caption": "3D model showing rigid-flex construction with integrated HV/LV isolation"
            },
            {
              "src": "images/UMEB/view1.png",
              "alt": "V3 Assembled Board",
              "caption": "V3 final production board with rigid-flex PCB - 40% more compact than V2"
            },
            {
              "src": "images/UMEB/view2.png",
              "alt": "V3 Assembled Board",
              "caption": "V3 final production board with rigid-flex PCB - 40% more compact than V2"
            }
          ]
        },
        {
          "type": "technical",
          "heading": "Telemetry Board Design",
          "content": "Collaborated on the telemetry board design, which required precise RF engineering for GPS functionality and robust industrial communication protocols. Contributed to critical signal integrity decisions for the RF and communication subsystems.",
          "subsections": [
            {
              "heading": "GPS Antenna Routing",
              "content": "Assisted in implementing controlled impedance routing (50Ω) for the GPS antenna trace using microstrip line calculations. The trace geometry was carefully calculated to maintain characteristic impedance matching between the GPS module and antenna connector, minimizing signal reflections and maximizing sensitivity. Load termination was added at the antenna end to prevent standing waves."
            }
          ]
        },
        {
          "type": "technical",
          "heading": "CAN Bus Signal Integrity",
          "content": "",
          "subsections": [
            {
              "heading": "Robust Communication Design",
              "content": "Contributed to the design of differential CAN bus traces with impedance matching (120Ω differential) and optocoupler isolation to protect the microcontroller from ground potential differences and electrical transients. Strategic component placement kept CANL/CANH traces away from noisy switching power supplies and other interference sources. Bus termination with 120Ω resistor ensured proper signal integrity."
            }
          ]
        },
        {
          "type": "gallery",
          "layout": "side-by-side",
          "images": [
            {
              "src": "images/UMEB/telem.png",
              "alt": "Telemetry Board",
              "caption": "Telemetry board featuring GPS module with impedance-matched antenna trace and optocoupled CAN bus interface"
            }
          ]
        },
        {
          "type": "results",
          "heading": "Results & Key Improvements",
          "content": "Through three design iterations, the system achieved production-ready reliability for demanding racing environments. Each version addressed specific failure modes and performance limitations discovered through rigorous testing.",
          "metrics": [
            {
              "value": "3",
              "label": "Design iterations"
            },
            {
              "value": "40%",
              "label": "Size reduction (V3)"
            },
            {
              "value": "10+",
              "label": "End users satisfied"
            }
          ]
        },
        {
          "type": "learnings",
          "heading": "Key Learnings",
          "content": "This project reinforced the importance of iterative design in high-reliability applications. The transition from V1 to V2 taught me that physical separation of HV/LV circuits provides far better isolation than simple PCB layout techniques. Moving to rigid-flex in V3 demonstrated that investing in advanced manufacturing processes can eliminate entire categories of failure modes - the cost of rigid-flex was justified by removing connector failures in high-vibration environments. RF design requires meticulous attention to transmission line theory; the GPS antenna routing showed that even small impedance mismatches significantly degrade performance. Finally, strategic ground plane management around switching regulators proved essential for EMI reduction - the cutouts under inductors reduced radiated emissions measurably. If given more time, I would implement a fourth iteration with integrated power monitoring on each rail and add redundant SD card storage with automatic failover for critical race data logging."
        },
        {
          "type": "overview",
          "heading": "To Be Continued...",
          "content": "The project is currently in the assembly and enclosure design phase. I'm designing a custom case to house the rigid-flex cockpit board and telemetry system, ensuring proper mechanical protection while maintaining access for debugging and field servicing. PCB assembly is underway with careful attention to component placement and soldering quality for the rigid-flex construction. Stay tuned for updates on the final integrated system and on-water testing results."
        }
      ]
    }
  ]
}
